code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮридическиеЛицаМеждународныеКомпании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Изменить признак международная компания юридического лица
//
// Параметры:
//  ЮридическоеЛицоСсылка	 - СправочникСсылка.ЮридическиеЛица	 - Ссылка на ЮридическоеЛицо до изменений
//  ЮридическоеЛицоОбъект	 - СправочникОбъект.ЮридическиеЛица	 - Изменяемый объект ЮридическоеЛицо
//  ОтменитьЗапись			 - Булево							 - Отмена
//
Процедура ИзменитьПризнакМеждународнаяКомпанияЮридическогоЛица(ЮридическоеЛицоСсылка, ЮридическоеЛицоОбъект, ОтменитьЗапись) Экспорт
	
	ПризнакРегистрацииМК = ЮридическоеЛицоОбъект.ПризнакРегистрацииМеждународнойКомпании;
	Если Не ЮридическоеЛицоОбъект.МеждународнаяКомпания
		И ЗначениеЗаполнено(ПризнакРегистрацииМК) Тогда
		ОтменитьЗапись = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо очистить поле ""Признак регистрации международной компании""",
			ЮридическоеЛицоСсылка, , "Объект.ПризнакРегистрацииМеждународнойКомпании");
		Возврат;
	КонецЕсли;
	
	СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮридическоеЛицоСсылка,
		"МеждународнаяКомпания, ДатаСменыСтатусаМеждународнаяКомпания, ПризнакРегистрацииМеждународнойКомпании");
	
	ИзменилсяМК = СтарыеРеквизиты.МеждународнаяКомпания <> ЮридическоеЛицоОбъект.МеждународнаяКомпания;
	ИзмениласьДатаМК =
		СтарыеРеквизиты.ДатаСменыСтатусаМеждународнаяКомпания <> ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания;
	ИзменилсяПризнакРегистрации =
		СтарыеРеквизиты.ПризнакРегистрацииМеждународнойКомпании <> ПризнакРегистрацииМК;
	ИзмененыМКИлиДатаМК = ИзменилсяМК Или ИзмениласьДатаМК;
	Если Не ИзмененыМКИлиДатаМК И ИзменилсяПризнакРегистрации Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.Период КАК Период,
		|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
		|	ЮридическиеЛицаМеждународныеКомпанииСрезПоследних.МеждународнаяКомпания КАК МеждународнаяКомпания
		|ИЗ
		|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(, ЮридическоеЛицо = &ЮридическоеЛицо) КАК ЮридическиеЛицаМеждународныеКомпанииСрезПоследних";
		
		Запрос.УстановитьПараметр("ЮридическоеЛицо", ЮридическоеЛицоСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			УстановитьПризнакМеждународнаяКомпания(Выборка.Период, ЮридическоеЛицоСсылка,
				Выборка.МеждународнаяКомпания, ПризнакРегистрацииМК);
		КонецЕсли;
	КонецЕсли;
	
	Если ОтменитьЗапись Или Не ИзмененыМКИлиДатаМК Тогда
		Возврат;
	КонецЕсли;
	
	ПустаяДата = Не ЗначениеЗаполнено(ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания);
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());
	ДатаБольшеТекущей = ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания > ТекущаяДата;
	Если ПустаяДата Или ДатаБольшеТекущей Тогда
		ОтменитьЗапись = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отмена изменений 'Международная компания'. Укажите корректную дату!");
		Возврат;
	КонецЕсли;
	
	Если ИзменилсяМК И Не ИзмениласьДатаМК Тогда
		УстановитьПризнакМеждународнаяКомпания(ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания, ЮридическоеЛицоСсылка,
			ЮридическоеЛицоОбъект.МеждународнаяКомпания, ПризнакРегистрацииМК);
	ИначеЕсли ИзмениласьДатаМК И Не ИзменилсяМК Тогда
		УдалитьЗаписьМеждународнаяКомпания(СтарыеРеквизиты.ДатаСменыСтатусаМеждународнаяКомпания, ЮридическоеЛицоСсылка);
		УстановитьПризнакМеждународнаяКомпания(ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания, ЮридическоеЛицоСсылка,
			ЮридическоеЛицоОбъект.МеждународнаяКомпания, ПризнакРегистрацииМК);
	Иначе
		УстановитьПризнакМеждународнаяКомпания(ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания, ЮридическоеЛицоСсылка,
			ЮридическоеЛицоОбъект.МеждународнаяКомпания, ПризнакРегистрацииМК);
		НоваяДатаМеньшеСтарой =
			ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания < СтарыеРеквизиты.ДатаСменыСтатусаМеждународнаяКомпания;
		Если НоваяДатаМеньшеСтарой Тогда
			ЮридическоеЛицоОбъект.МеждународнаяКомпания = СтарыеРеквизиты.МеждународнаяКомпания;
			ЮридическоеЛицоОбъект.ДатаСменыСтатусаМеждународнаяКомпания = СтарыеРеквизиты.ДатаСменыСтатусаМеждународнаяКомпания;
			ЮридическоеЛицоОбъект.ПризнакРегистрацииМеждународнойКомпании = СтарыеРеквизиты.ПризнакРегистрацииМеждународнойКомпании;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает последнее значение ресурса ЯвляетсяМК по ЮрЛицу
//
// Параметры:
//  ПериодОтбора	 - Дата								 - Период
//  ЮридическоеЛицо	 - СправочникСсылка.ЮридическиеЛица	 - Юридическое лицо
// 
// Возвращаемое значение:
//   - Произвольный - значение ресурса\реквизита
//
Функция ЭтоМК(ПериодОтбора, ЮридическоеЛицо) Экспорт
	Отбор = Новый Структура("ЮридическоеЛицо", ЮридическоеЛицо);
	Возврат РегистрыСведений.ЮридическиеЛицаМеждународныеКомпании.ПолучитьПоследнее(ПериодОтбора, Отбор).МеждународнаяКомпания;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Установить признак международная компания
//
// Параметры:
//  Период									 - Дата		 - Период
//  ЮридическоеЛицо							 - СправочникСсылка.ЮридическиеЛица	 - Юридическое Лицо
//  МеждународнаяКомпания					 - Булево							 - Признак международной компании
//  ПризнакРегистрацииМеждународнойКомпании	 - ПеречислениеСсылка.ПризнакРегистрацииМеждународнойКомпании - Признак регистрации МК
//  Комментарий								 - Строка							 - Комментарий
//
Процедура УстановитьПризнакМеждународнаяКомпания(Период, ЮридическоеЛицо, МеждународнаяКомпания,
	ПризнакРегистрацииМеждународнойКомпании, Комментарий = Неопределено) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЮридическоеЛицо.Установить(ЮридическоеЛицо);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период					 = Период;
	НоваяЗапись.ЮридическоеЛицо			 = ЮридическоеЛицо;
	НоваяЗапись.МеждународнаяКомпания	 = МеждународнаяКомпания;
	НоваяЗапись.ПризнакРегистрацииМеждународнойКомпании = ПризнакРегистрацииМеждународнойКомпании;
	Если Не Комментарий = Неопределено Тогда
		НоваяЗапись.Комментарий			 = Комментарий;
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура - Удалить запись о признаке международная компания
//
// Параметры:
//  Период			 - Дата								 - Период
//  ЮридическоеЛицо	 - СправочникСсылка.ЮридическиеЛица	 - Юридическое Лицо
//
Процедура УдалитьЗаписьМеждународнаяКомпания(Период, ЮридическоеЛицо) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЮридическоеЛицо.Установить(ЮридическоеЛицо);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
